cmsis-svd/cmsis-svd/data/Renesas/R7FA6M1AD.svd
                <register>
                    <name>SPTR</name>
                    <description>Serial Port Register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x03</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>3</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPB2IO</name>
                            <description>Serial port break I/O bit
(It's selected whether the value of SPB2DT is output to TxD terminal.)</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The value of SPB2DT bit isn't output in TxD terminal.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The value of SPB2DT bit is output in TxD terminal.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SPB2DT</name>
                            <description>Serial port break data select bit
(The output level of TxD terminal is selected when SCR.TE = 0.)</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Low level is output in TxD terminal.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>High level is output in TxD terminal.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RXDMON</name>
                            <description>Serial input data monitor bit
(The state of the RXD terminal is shown.)</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>RXD terminal is the Low level. </description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>RXD terminal is the High level.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI1</name>
            <description>Serial Communication Interface 1</description>
            <baseAddress>0x40070020</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI2</name>
            <description>Serial Communication Interface 2</description>
            <baseAddress>0x40070040</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI3</name>
            <description>Serial Communication Interface 3</description>
            <baseAddress>0x40070060</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI4</name>
            <description>Serial Communication Interface 4</description>
            <baseAddress>0x40070080</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI8</name>
            <description>Serial Communication Interface 8</description>
            <baseAddress>0x40070100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="SCI0">
            <name>SCI9</name>
            <description>Serial Communication Interface 9</description>
            <baseAddress>0x40070120</baseAddress>
        </peripheral>
        <peripheral>
            <name>SDHI0</name>
            <description>SD Host Interface 0</description>
            <baseAddress>0x40062000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>84</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x58</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x68</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1B0</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1C0</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1E0</offset>
                <size>32</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>SD_CMD</name>
                    <description>Command Type Register</description>
                    <addressOffset>0x000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000. The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMD12AT</name>
                            <description>Multiple Block Transfer Mode (enabled at multiple block transfer)</description>
                            <lsb>14</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>CMD12 is automatically issued at multiple block transfer.</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>CMD12 is not automatically issued at multiple block transfer.</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Setting prohibited</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Setting prohibited</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TRSTP</name>
                            <description>Single/Multiple Block Transfer (enabled when the command with data is handled)</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Single block transfer</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Multiple block transfer</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMDRW</name>
                            <description>Write/Read Mode (enabled when the command with data is handled)</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Write (SD/MMC host interface -&gt; SD card/MMC)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Read (SD/MMC host interface &lt;- SD card/MMC)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMDTP</name>
                            <description>Data Mode (Command Type)</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Command does not include data transfer (bc, bcr, or ac)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Command includes data transfer (adtc)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RSPTP</name>
                            <description>Mode/Response Type
NOTE: As some commands cannot be used in normal mode, see section 1.4.10, Example of SD_CMD Register Setting to select mode/response type.</description>
                            <lsb>8</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>Normal mode The response type and the transfer mode are selected by SD_CMD[7:0], and the SD_CMD[15:11] setting is disabled. </description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>Expansion mode and no response</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>100</name>
                                    <description>Expansion mode and R1, R5, R6, or R7 response</description>
                                    <value>#100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101</name>
                                    <description>Expansion mode and R1b response</description>
                                    <value>#101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>110</name>
                                    <description>Expansion mode and R2 response</description>
                                    <value>#110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>111</name>
                                    <description>Expansion mode and R3 or R4 response</description>
                                    <value>#111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Settings prohibited.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ACMD</name>
                            <description>Command Type Select</description>
                            <lsb>6</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>CMD</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>ACMD</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMDIDX</name>
                            <description>Command Index
These bits specify Command Format[45:40] (command index).
[Examples]
CMD6: SD_CMD[7:0] = 8'b00_000110
CMD18: SD_CMD[7:0] = 8'b00_010010
ACMD13: SD_CMD[7:0] = 8'b01_001101</description>
                            <lsb>0</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SD_ARG</name>
                    <description>SD Command Argument Register</description>
                    <addressOffset>0x008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SD_ARG</name>
                            <description>Argument Register
Set command format[39:8] (argument)</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SD_ARG1</name>
                    <description>SD Command Argument Register 1</description>
                    <addressOffset>0x00C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000. The write value should be 0000000000000000.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SD_ARG1</name>
                            <description>Argument Register 1
Set command format[39:24] (argument)</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
