cmsis-svd/cmsis-svd/data/Renesas/R7FA6M1AD.svd
                <register>
                    <name>GTSTR</name>
                    <description>General PWM Timer Software Start Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000000000000000. The write value should be 0000000000000000000.</description>
                            <lsb>13</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CSTRT12</name>
                            <description>Channel 12 GTCNT Count Start
Read data shows each channel's counter status (GTCR.CST bit). 
0 means counter stop. 1 means counter running.</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No effect (write) / counter stop (read)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GPT3212.GTCNT counter starts (write) / Counter running (read)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CSTRT11</name>
                            <description>Channel 11 GTCNT Count Start
Read data shows each channel's counter status (GTCR.CST bit). 
0 means counter stop. 1 means counter running.</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No effect (write) / counter stop (read)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GPT3211.GTCNT counter starts (write) / Counter running (read)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CSTRT10</name>
                            <description>Channel 10 GTCNT Count Start
Read data shows each channel's counter status (GTCR.CST bit). 
0 means counter stop. 1 means counter running.</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No effect (write) / counter stop (read)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GPT3210.GTCNT counter starts (write) / Counter running (read)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CSTRT9</name>
                            <description>Channel 9 GTCNT Count Start
Read data shows each channel's counter status (GTCR.CST bit). 
0 means counter stop. 1 means counter running.</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No effect (write) / counter stop (read)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GPT329.GTCNT counter starts (write) / Counter running (read)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CSTRT8</name>
                            <description>Channel 8 GTCNT Count Start
Read data shows each channel's counter status (GTCR.CST bit). 
0 means counter stop. 1 means counter running.</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No effect (write) / counter stop (read)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GPT328.GTCNT counter starts (write) / Counter running (read)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CSTRT7</name>
                            <description>Channel 7 GTCNT Count Start
Read data shows each channel's counter status (GTCR.CST bit). 
0 means counter stop. 1 means counter running.</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No effect (write) / counter stop (read)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GPT32E7.GTCNT counter starts (write) / Counter running (read)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CSTRT6</name>
                            <description>Channel 6 GTCNT Count Start
Read data shows each channel's counter status (GTCR.CST bit). 
0 means counter stop. 1 means counter running.</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No effect (write) / counter stop (read)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GPT32E6.GTCNT counter starts (write) / Counter running (read)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CSTRT5</name>
                            <description>Channel 5 GTCNT Count Start
Read data shows each channel's counter status (GTCR.CST bit). 
0 means counter stop. 1 means counter running.</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No effect (write) / counter stop (read)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GPT32E5.GTCNT counter starts (write) / Counter running (read)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CSTRT4</name>
                            <description>Channel 4 GTCNT Count Start
Read data shows each channel's counter status (GTCR.CST bit). 
0 means counter stop. 1 means counter running.</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No effect (write) / counter stop (read)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GPT32E4.GTCNT counter starts (write) / Counter running (read)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CSTRT3</name>
                            <description>Channel 3 GTCNT Count Start
Read data shows each channel's counter status (GTCR.CST bit). 
0 means counter stop. 1 means counter running.</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No effect (write) / counter stop (read)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GPT32EH3.GTCNT counter starts (write) / Counter running (read)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CSTRT2</name>
                            <description>Channel 2 GTCNT Count Start
Read data shows each channel's counter status (GTCR.CST bit). 
0 means counter stop. 1 means counter running.</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No effect (write) / counter stop (read)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GPT32EH2.GTCNT counter starts (write) / Counter running (read)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CSTRT1</name>
                            <description>Channel 1 GTCNT Count Start
Read data shows each channel's counter status (GTCR.CST bit). 
0 means counter stop. 1 means counter running.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No effect (write) / counter stop (read)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GPT32EH1.GTCNT counter starts (write) / Counter running (read)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CSTRT0</name>
                            <description>Channel 0 GTCNT Count Start
Read data shows each channel's counter status (GTCR.CST bit). 
0 means counter stop. 1 means counter running.</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No effect (write) / counter stop (read)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>GPT32EH0.GTCNT counter starts (write) / Counter running (read)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
