cmsis-svd/cmsis-svd/data/Renesas/R7FA6M1AD.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>SPMON</name>
            <description>CPU Stack Pointer Monitor</description>
            <baseAddress>0x40000D00</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x04</offset>
                <size>14</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x14</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>MSPMPUOAD</name>
                    <description>Stack Pointer Monitor Operation After Detection Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>KEY</name>
                            <description>Write Keyword 
The data written to these bits are not stored.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0xA5</name>
                                    <description>Writing to the OAD bit is valid, when the KEY bits are written 0xA5.</description>
                                    <value>0xA5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Writing to the OAD bit is invalid.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OAD</name>
                            <description>Operation after detection</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Reset</description>
                                    <value>#1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Non-maskable interrupt</description>
                                    <value>#0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSPMPUCTL</name>
                    <description>Stack Pointer Monitor Access Control Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFEFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>9</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERROR</name>
                            <description>Stack Pointer Monitor Error Flag</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No stack pointer overflow or underflow occurred</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Stack pointer overflow or underflow occurred</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENABLE</name>
                            <description>Stack Pointer Monitor Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable stack pointer monitor</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable stack pointer monitor</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSPMPUPT</name>
                    <description>Stack Pointer Monitor Protection Register</description>
                    <addressOffset>0x06</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>KEY</name>
                            <description>Key Code
 Write data is not saved.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0xA5</name>
                                    <description>Writing to the PROTECT bit is valid, when the KEY bits are written 0xA5.</description>
                                    <value>0xA5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Writing to the PROTECT bit is invalid.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PROTECT</name>
                            <description>Protection of register</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Stack pointer monitor register writes are permitted</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Stack pointer monitor register writes are protected. Reads are permitted.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSPMPUSA</name>
                    <description>Main Stack Pointer Monitor Start Address Register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>MSPMPUSA</name>
                            <description>Region Start Address : 
Address where the region starts, for use in region determination.
NOTE: Range: 0x1FF00000-0x200FFFFC
         The low-order 2 bits are fixed to 0.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x1FF00000</minimum>
                                    <maximum>0x200FFFFC</maximum>
                                </range>
                            </writeConstraint>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSPMPUEA</name>
                    <description>Main Stack Pointer Monitor End Address Register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>MSPMPUEA</name>
                            <description>Region End Address : 
Address where the region ends, for use in region determination.
NOTE: Range: 0x1FF00003-0x200FFFFF
         The low-order 2 bits are fixed to 1.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x1FF00003</minimum>
                                    <maximum>0x200FFFFF</maximum>
                                </range>
                            </writeConstraint>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSPMPUOAD</name>
                    <description>Stack Pointer Monitor Operation After Detection Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>KEY</name>
                            <description>Write Keyword 
The data written to these bits are not stored.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0xA5</name>
                                    <description>Writing to the OAD bit is valid, when the KEY bits are written 0xA5.</description>
                                    <value>0xA5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Writing to the OAD bit is invalid.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OAD</name>
                            <description>Operation after detection</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Reset</description>
                                    <value>#1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Non-maskable interrupt.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSPMPUCTL</name>
                    <description>Stack Pointer Monitor Access Control Register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFEFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>9</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERROR</name>
                            <description>Stack Pointer Monitor Error Flag</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No stack pointer overflow or underflow occurred</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Stack pointer overflow or underflow occurred</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENABLE</name>
                            <description>Stack Pointer Monitor Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable stack pointer monitor</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable stack pointer monitor</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSPMPUPT</name>
                    <description>Stack Pointer Monitor Protection Register</description>
                    <addressOffset>0x16</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>KEY</name>
                            <description>Key Code
 Write data is not saved.</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0xA5</name>
                                    <description>Writing to the PROTECT bit is valid, when the KEY bits are written 0xA5.</description>
                                    <value>0xA5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Writing to the PROTECT bit is invalid.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PROTECT</name>
                            <description>Protection of register</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Stack pointer monitor register writes are permitted</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Stack pointer monitor register writes are protected. Reads are permitted.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSPMPUSA</name>
                    <description>Process Stack Pointer Monitor Start Address Register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>PSPMPUSA</name>
                            <description>Region Start Address : 
Address where the region starts, for use in region determination.
NOTE: Range: 0x1FF00000-0x200FFFFC
         The low-order 2 bits are fixed to 0.</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <writeConstraint>
                                <range>
                                    <minimum>0x1FF00000</minimum>
                                    <maximum>0x200FFFFC</maximum>
                                </range>
                            </writeConstraint>
                        </field>
                    </fields>
                </register>
